let songInfo = {
    "lrc": {
        "version": 7,
        "lyric": "[00:00.000] 作词 : 蔡健雅\n[00:01.000] 作曲 : 蔡健雅\n[00:02.000] 原唱 : 蔡健雅\n[00:05.94]制作人：关天天\n[00:06.39]出品：网易子弹 x网易喜雨\n[00:14.97] OP： Tangy Music Publishing Warner Chappell Music, Hong Kong Limited Taiwan Branch\n[00:16.59] SP： Warner Chappell Music Publishing Agency Beijing Ltd.\n[00:17.82]在我二十二岁时\n[00:21.36]回想起当时多么想谈恋爱\n[00:26.49]妈妈说就让它来\n[00:31.44]然而在我三十二岁时\n[00:35.61]发现我没太多的心去等待\n[00:40.68]它失去某种色彩\n[00:46.23]得不到的就更加爱\n[00:49.38]太容易来的就不理睬\n[00:52.80]其实谁不想遇见真爱\n[00:56.82]爱得绝对\n[00:58.56]爱得坦白\n[01:00.27]以为遇上了就会明白\n[01:03.66]但每次它只留下\n[01:05.58]惊鸿一瞥的感慨\n[01:12.42]我越来越不懂爱\n[01:28.53]才三十二岁的我\n[01:31.95]虽然一个人过\n[01:33.84]也过得够精彩\n[01:37.17]偶尔才想谈恋爱\n[01:44.65]然而爱总是乱了节拍\n[01:46.20]我只能够瞎猜\n[01:48.03]也许能中了头彩\n[01:51.24]中了又觉得奇怪\n[01:56.79]得不到的就更加爱\n[02:00.03]太容易来的就不理睬\n[02:03.42]其实谁不想遇见真爱\n[02:07.41]爱得绝对\n[02:09.12]爱得坦白\n[02:10.83]以为遇上了就会明白\n[02:14.19]但每次它只留下\n[02:16.20]惊鸿一瞥的感慨\n[02:23.07]我越来越不懂爱\n[02:27.75]得不到的无所谓\n[02:30.93]就算是自我安慰\n[02:34.65]没必要伤悲\n[02:39.09]得不到的就更加爱\n[02:42.30]太容易来的就不理睬\n[02:45.75]其实谁不想遇见真爱\n[02:49.77]爱得绝对\n[02:51.27]爱得坦白\n[02:53.19]以为遇上了就会明白\n[02:56.55]但每次它只留下\n[02:58.53]惊鸿一瞥的感慨\n[03:05.16]我越来越不懂爱\n[03:07.26]以为遇上了就会明白\n[03:10.71]但每次它只留下\n[03:12.60]惊鸿一瞥的感慨\n[03:19.50]我越来越不懂爱\n[03:27.51]我什么都不懂\n[03:35.22]越来越不懂\n[03:36.09]编曲：关天天\n[03:36.51]吉他：劳国贤/关天天\n[03:36.87]贝斯：关天天\n[03:37.26]混音：侯春阳\n[03:37.62]母带：全相彦\n[03:37.71]伴唱：沙栩帆\n[03:38.04]制作统筹： Ocd/刘京\n[03:38.58]商务统筹：陈亦心/荆晓涵\n[03:38.64]监制： lil老王/荆晓涵\n[03:38.85]宣发：叶增辉/黄慧卿/单杰妮\n[03:39.15]出品人：如风/姚政/张浩\n[03:39.78]联合出品：无忧音乐\n"
    },
    "songUrl": "http://127.0.0.1:3000/music/how2j.m4a",
    "name": "越来越不懂",
    "id": 1999597229,
    "pst": 0,
    "t": 0,
    "ar": [
        {
            "id": 29588305,
            "name": "刘大拿",
            "tns": [],
            "alias": []
        }
    ],
    "alia": [],
    "pop": 100,
    "st": 0,
    "rt": "",
    "fee": 8,
    "v": 5,
    "crbt": null,
    "cf": "",
    "al": {
        "id": 155173031,
        "name": "越来越不懂",
        "picUrl": "https://p2.music.126.net/fsOItUd1l2QhrUQwOqui-A==/109951168072540031.jpg?param=34y34",
        "tns": [],
        "pic_str": "109951168072540031",
        "pic": 109951168072540030
    },
    "dt": 222237,
    "h": {
        "br": 320000,
        "fid": 0,
        "size": 8892125,
        "vd": -60037,
        "sr": 44100
    },
    "m": {
        "br": 192000,
        "fid": 0,
        "size": 5335293,
        "vd": -57463,
        "sr": 44100
    },
    "l": {
        "br": 128000,
        "fid": 0,
        "size": 3556876,
        "vd": -55828,
        "sr": 44100
    },
    "sq": {
        "br": 976887,
        "fid": 0,
        "size": 27137603,
        "vd": -60285,
        "sr": 44100
    },
    "hr": null,
    "a": null,
    "cd": "01",
    "no": 0,
    "rtUrl": null,
    "ftype": 0,
    "rtUrls": [],
    "djId": 0,
    "copyright": 0,
    "s_id": 0,
    "mark": 0,
    "originCoverType": 2,
    "originSongSimpleData": {
        "songId": 208958,
        "name": "越来越不懂",
        "artists": [
            {
                "id": 7214,
                "name": "蔡健雅"
            }
        ],
        "albumMeta": {
            "id": 21260,
            "name": "Close To 蔡健雅 Original X Tanya Demo"
        }
    },
    "tagPicList": null,
    "resourceState": true,
    "version": 5,
    "songJumpInfo": null,
    "entertainmentTags": null,
    "awardTags": null,
    "single": 0,
    "noCopyrightRcmd": null,
    "rtype": 0,
    "rurl": null,
    "mst": 9,
    "cp": 0,
    "mv": 0,
    "publishTime": 0
}

class SongController {
    getSong(ctx) {
        ctx.body = songInfo;
    }
}

module.exports = new SongController();